USE ecoride;

INSERT INTO trajets 
(conducteur_id, vehicule_id, ville_depart, ville_arrivee, date_depart, date_arrivee, prix, places_dispo, eco, statut)
VALUES
(1, 2, 'Lille', 'Paris', '2025-06-03 08:00:00', '2025-06-03 12:00:00', 25.00, 3, 0, 'terminé'),
(1, 2, 'Paris', 'Lyon', '2025-06-04 09:30:00', '2025-06-04 14:00:00', 30.00, 4, 1, 'terminé'),
(3, 15, 'Reims', 'Paris', '2025-06-12 09:00:00', '2025-06-12 11:00:00', 12.00, 1, 1, 'terminé'),
(2, 15, 'Lyon', 'Marseille', '2025-06-05 07:00:00', '2025-06-05 11:30:00', 28.50, 2, 0, 'terminé'),
(2, 15, 'Paris', 'Bordeaux', '2025-06-06 10:00:00', '2025-06-06 16:00:00', 35.00, 3, 1, 'terminé'),
(4, 14, 'Toulouse', 'Nice', '2025-06-07 06:00:00', '2025-06-07 13:00:00', 40.00, 1, 0, 'terminé'),
(4, 13, 'Marseille', 'Lille', '2025-06-08 09:00:00', '2025-06-08 19:00:00', 50.00, 4, 1, 'terminé'),
(3, 15, 'Nantes', 'Strasbourg', '2025-06-09 08:00:00', '2025-06-09 18:00:00', 45.00, 2, 0, 'terminé'),
(1, 2, 'Lyon', 'Reims', '2025-06-10 07:30:00', '2025-06-10 11:00:00', 22.00, 3, 1, 'terminé'),
(2, 15, 'Paris', 'Toulouse', '2025-06-11 08:00:00', '2025-06-11 14:30:00', 38.00, 2, 1, 'terminé');

